Groupby Operations involve:
- Split
- Apply 
- Combine 
Pandas does all of this for this with a simple method call: .groupby()

In [4]:
import pandas as pd
#create dataframe 
data = {'Company': ['GOOGLE','GOOGLE','FB','FB','ZALO'],
        'Person': ['Sam','Amy','Charlie','Carl','Sarah'],
        'Sales':[200,100,50,150,100]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0  GOOGLE      Sam    200
1  GOOGLE      Amy    100
2      FB  Charlie     50
3      FB     Carl    150
4    ZALO    Sarah    100

In [8]:
# df.groupby('Company').mean()
# df.groupby('Company').std()
df.groupby('Company').describe()

        Sales
        count   mean        std    min    25%    50%    75%    max
Company
FB        2.0  100.0  70.710678   50.0   75.0  100.0  125.0  150.0
GOOGLE    2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0
ZALO      1.0  100.0        NaN  100.0  100.0  100.0  100.0  100.0

In [9]:
df.groupby('Company').describe().transpose()

Company              FB      GOOGLE   ZALO
Sales count    2.000000    2.000000    1.0
      mean   100.000000  150.000000  100.0
      std     70.710678   70.710678    NaN
      min     50.000000  100.000000  100.0
      25%     75.000000  125.000000  100.0
      50%    100.000000  150.000000  100.0
      75%    125.000000  175.000000  100.0
      max    150.000000  200.000000  100.0

**Operations**

In [2]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4], 'col2':[100,200,300,100], 'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   100  abc
1     2   200  def
2     3   300  ghi
3     4   100  xyz

In [3]:
df['col2'].unique()

array([100, 200, 300], dtype=int64)

In [5]:
df['col2'].nunique() #number unique values

3

In [7]:
df['col2'].value_counts() #unique value - number of times it occurs

100    2
300    1
200    1
Name: col2, dtype: int64

In [11]:
new_df = df[(df['col1']>2)& (df['col2']==100)]
new_df

   col1  col2 col3
3     4   100  xyz

In [12]:
def times_two(number):
    return number*2

In [14]:
times_two(2)

4

In [16]:
#apply this function for every single value in a column, example column one 
# df.apply(times_two) #all df
df['col1'].apply(times_two)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [17]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [19]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
col1    4 non-null int64
col2    4 non-null int64
col3    4 non-null object
dtypes: int64(2), object(1)
memory usage: 176.0+ bytes

In [23]:
df.sort_values('col2', ascending = False)

   col1  col2 col3
2     3   300  ghi
1     2   200  def
0     1   100  abc
3     4   100  xyz